sdaiInsertAfter(Sdai_ItrId*,SdaiPrimitiveType,BTEllipsis)
\details
Inserts a new value into an application instance list after the element referenced by a specified iterator.
\param iterator  [in] An iterator object.
\param valueType [in] A type of the inserted value.
\remarks
You can insert more than one value into the list: pass as many values as you need after the parameter that specifies the data type.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiVT_NVLD - Value type invalid.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiIR_NEXS - Iterator does not exist.
* sdaiIR_NSET - Iterator has no current value.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance cartesianPoint1 = sdaiCreateInstanceBN(model, "odacartesianpoint");
SdaiList coordinates1 = sdaiCreateAggrBN(cartesianPoint1, "coordinates");
SdaiIterator it = sdaiCreateIterator(coordinates1);
sdaiInsertAfter(it, sdaiREAL, 1.1);
sdaiNext(it);
...